# Для простоты понимания переменная в Python - это коробка, в которой лежат данные.
# Но правильно понимать переменную как ссылку на данные, которые лежат в памяти!!!

# Python язык с динамической типизацией. В отличии от языков со статической типизацией, в переменной Python может быть быть значение любого типа в единицу времени.
# Но также Python это язык с сильной типизацией. Т.е неявно он не приводит типы как например это делает JS!

#Присваивание и вывод значения переменной

pi = 3.14
# Пишем комментарии
# имя пользователя
'''имя пользователя в 
многострочном комментарии'''
user_name = 'Ivan'
print(pi)
print(user_name)

'''Переменным даем осмысленные имена. А также не даем имена из числа зарезервиованных слов Python'''

# Переменные в Python регистрозависимые User, user, USER - это все разные меременные