# Программы могут быть интерактивными, т.е обмениваться данными с пользователем, в частности принимать от пользователя данные
name = input('Скажи мне свое имя >> ')
# Затем программа может что-то делать с этими данными и возвращать результат этих действий пользователю.
print('Теперь я заню, что тебя зовут', name, '!')
print('просто строка текста')
# С помощью так называемых манипуляторов, можно управлять выводом
print('Теперь я заню, что тебя зовут', name, '!', end='')
print('просто строка текста')

print('Теперь я заню, что тебя зовут', name, '!', end=' ')
print('просто строка текста')

# Типы данных:
# str - строковый тип данных, последовательность символов в кавычках 'какой то текст и 89 символы'
# int - любое целое число
# float - любое десятичное число
# bool - логическое значение True или False

# встроенная функция type() позволяет определить тип значения переменной
simple_string = 'просто строка текста'
print('тип', 'simple_string', '-', type(simple_string))
kilo = 1000
print('тип', 'kilo', '-', type(kilo))
temperature = 86.9
print('тип', 'temperature', '-', type(temperature))
flag = True
print('тип', 'flag', '-', type(flag))
result = 8 < 4
print('тип', 'result', '-', type(result))

# Приведение типов....
# Часто, чтобы совершить нужную операцию, нужно привести типы к определенному значению
# Для приведения используем функции int(), float(), str(), bool()

num1 = input('Введи число 1 >> ')
num2 = input('Введи число 2 >> ')
# функция input() возвращает результат своего действия в виде строки, т.е в данном случае она вернет строковые значения числа 1 и числа 2
# Поэтому, чтобы с числами полученными после ввода произвести арифметические действия, их нужно привести к типу int
result = int(num1) + int(num2)
print('Сумма введенных тобой чисел =', result)

# В противном случае получим конкатенация строковых значений числв 1 и Числа 2
print('Результат сложения введенных чисел без приведения к типу int', num1 + num2)

# Ну и если типы не будут совпадать - получи ошибочку! :)
#print(int(num1) + num2)

# Игра "Угадай число"
import random as rand
LOW = 1
HI = 20
flag = True
guess = 0
tryes = 0

num = rand.randint(LOW, HI)

print()
print('**********************************************')
print('Угадай за 10 попыток число от', LOW, 'до', HI)
print('**********************************************')

# while flag:
#     guess = input('Введи предполагаемое число >> ')
#     if tryes == 9:
#         print('Ты исчерпал все попытки и проиграл!')
#         break
#     else:
#         tryes += 1
#     if not guess.isdigit():
#         print('Вводить нужно только цифры!!!')
#         # не засчитываем попытку
#         tryes -= 1
#         continue
#     if int(guess) > num:
#         print('Введенное тобой число больше загаданного')
#         continue
#     if int(guess) < num:
#         print('Введенное тобой число меньше загаданного')
#         continue
#     if int(guess) == num:
#         print('Ты угадал!')
#         print('Количество попыток', tryes)
#         flag = False

# while flag:
#     guess = input('Введи предполагаемое число >> ')
#     if not guess.isdigit():
#         print('Вводить нужно только цифры!!!')
#         continue
#     tryes += 1
#     if tryes == 10:
#         print('Ты исчерпал все попытки и проиграл!')
#         break
#     guess = int(guess)
#     if guess > num:
#         print('Введенное тобой число больше загаданного')
#     elif guess < num:
#         print('Введенное тобой число меньше загаданного')
#     else:
#         print('Ты угадал!')
#         print('Количество попыток', tryes)
#         flag = False

while flag:
    if tryes == 10:
        print('Ты исчерпал все попытки и проиграл!')
        break

    guess = input('Введи предполагаемое число >> ')

    if not guess.isdigit():
        print('Вводить нужно только цифры!!!')
        continue

    tryes += 1
    guess = int(guess)

    if guess > num:
        print('Введенное тобой число больше загаданного')
    elif guess < num:
        print('Введенное тобой число меньше загаданного')
    else:
        print('Ты угадал!')
        print('Количество попыток', tryes)
        flag = False

# Отступы - это аналог фигурных {...} скобок, т.е блок кода

# Во время создания этой небольшой прграммы были определенные ошибки
# Ошибки бывают:
# Синтаксические (Sytax Error) - неправильно написанные команды, опечатки
# Ошибки времени исполнения (Runtime Error) - ошибка происходит во время исполнения программы (такие ошибки и возможное их возникновение нужно обрабатывать try catch)
# Семантические ошибки (Semantic Error) - это логические ошибки, вроде бы как работает, но в результате получается фигня! :)
